apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_snvs.h
/*****************************************************************************
 * arch/arm/src/imxrt/hardware/rt117x/imxrt117x_snvs.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 *****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_SNVS_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_SNVS_H

/*****************************************************************************
 * Included Files
 *****************************************************************************/

#include <nuttx/config.h>

/*****************************************************************************
 * Preprocessor Definitions
 *****************************************************************************/

/* SNVS Register Offsets *****************************************************/
#define IMXRT_SNVS_HPLR_OFFSET                 (0x0000)
#define IMXRT_SNVS_HPCOMR_OFFSET               (0x0004)
#define IMXRT_SNVS_HPCR_OFFSET                 (0x0008)
#define IMXRT_SNVS_HPSICR_OFFSET               (0x000c)
#define IMXRT_SNVS_HPSVCR_OFFSET               (0x0010)
#define IMXRT_SNVS_HPSR_OFFSET                 (0x0014)
#define IMXRT_SNVS_HPSVSR_OFFSET               (0x0018)
#define IMXRT_SNVS_HPHACIVR_OFFSET             (0x001c)
#define IMXRT_SNVS_HPHACR_OFFSET               (0x0020)
#define IMXRT_SNVS_HPRTCMR_OFFSET              (0x0024)
#define IMXRT_SNVS_HPRTCLR_OFFSET              (0x0028)
#define IMXRT_SNVS_HPTAMR_OFFSET               (0x002c)
#define IMXRT_SNVS_HPTALR_OFFSET               (0x0030)
#define IMXRT_SNVS_LPLR_OFFSET                 (0x0034)
#define IMXRT_SNVS_LPCR_OFFSET                 (0x0038)
#define IMXRT_SNVS_LPMKCR_OFFSET               (0x003c)
#define IMXRT_SNVS_LPSVCR_OFFSET               (0x0040)
#define IMXRT_SNVS_LPTGFCR_OFFSET              (0x0044)
#define IMXRT_SNVS_LPTDCR_OFFSET               (0x0048)
#define IMXRT_SNVS_LPSR_OFFSET                 (0x004c)
#define IMXRT_SNVS_LPSRTCMR_OFFSET             (0x0050)
#define IMXRT_SNVS_LPSRTCLR_OFFSET             (0x0054)
#define IMXRT_SNVS_LPTAR_OFFSET                (0x0058)
#define IMXRT_SNVS_LPSMCMR_OFFSET              (0x005c)
#define IMXRT_SNVS_LPSMCLR_OFFSET              (0x0060)
#define IMXRT_SNVS_LPLVDR_OFFSET               (0x0064)
#define IMXRT_SNVS_LPGPR0_LEGACY_ALIAS_OFFSET  (0x0068)
#define IMXRT_SNVS_LPTDC2R_OFFSET              (0x00a0)
#define IMXRT_SNVS_LPTDSR_OFFSET               (0x00a4)
#define IMXRT_SNVS_LPTGF1CR_OFFSET             (0x00a8)
#define IMXRT_SNVS_LPTGF2CR_OFFSET             (0x00ac)
#define IMXRT_SNVS_LPAT1CR_OFFSET              (0x00c0)
#define IMXRT_SNVS_LPAT2CR_OFFSET              (0x00c4)
#define IMXRT_SNVS_LPAT3CR_OFFSET              (0x00c8)
#define IMXRT_SNVS_LPAT4CR_OFFSET              (0x00cc)
#define IMXRT_SNVS_LPAT5CR_OFFSET              (0x00d0)
#define IMXRT_SNVS_LPATCTLR_OFFSET             (0x00e0)
#define IMXRT_SNVS_LPATCLKR_OFFSET             (0x00e4)
#define IMXRT_SNVS_LPATRC1R_OFFSET             (0x00e8)
#define IMXRT_SNVS_LPATRC2R_OFFSET             (0x00ec)
#define IMXRT_SNVS_HPVIDR1_OFFSET              (0x0bf8)
#define IMXRT_SNVS_HPVIDR2_OFFSET              (0x0bfc)
#define IMXRT_SNVS_LPZMKR0_OFFSET              (0x006c)
#define IMXRT_SNVS_LPZMKR1_OFFSET              (0x0070)
#define IMXRT_SNVS_LPZMKR2_OFFSET              (0x0074)
#define IMXRT_SNVS_LPZMKR3_OFFSET              (0x0078)
#define IMXRT_SNVS_LPZMKR4_OFFSET              (0x007c)
#define IMXRT_SNVS_LPZMKR5_OFFSET              (0x0080)
#define IMXRT_SNVS_LPZMKR6_OFFSET              (0x0084)
#define IMXRT_SNVS_LPZMKR7_OFFSET              (0x0088)
#define IMXRT_SNVS_LPGPR_ALIAS0_OFFSET         (0x0090)
#define IMXRT_SNVS_LPGPR_ALIAS1_OFFSET         (0x0094)
#define IMXRT_SNVS_LPGPR_ALIAS2_OFFSET         (0x0098)
#define IMXRT_SNVS_LPGPR_ALIAS3_OFFSET         (0x009c)
#define IMXRT_SNVS_LPGPR0_OFFSET               (0x0100)
#define IMXRT_SNVS_LPGPR1_OFFSET               (0x0104)
#define IMXRT_SNVS_LPGPR2_OFFSET               (0x0108)
#define IMXRT_SNVS_LPGPR3_OFFSET               (0x010c)

/* SNVS Register Addresses ***************************************************/
#define IMXRT_SNVS_HPLR                 (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPLR_OFFSET)
#define IMXRT_SNVS_HPCOMR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPCOMR_OFFSET)
#define IMXRT_SNVS_HPCR                 (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPCR_OFFSET)
#define IMXRT_SNVS_HPSICR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPSICR_OFFSET)
#define IMXRT_SNVS_HPSVCR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPSVCR_OFFSET)
#define IMXRT_SNVS_HPSR                 (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPSR_OFFSET)
#define IMXRT_SNVS_HPSVSR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPSVSR_OFFSET)
#define IMXRT_SNVS_HPHACIVR             (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPHACIVR_OFFSET)
#define IMXRT_SNVS_HPHACR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPHACR_OFFSET)
#define IMXRT_SNVS_HPRTCMR              (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPRTCMR_OFFSET)
#define IMXRT_SNVS_HPRTCLR              (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPRTCLR_OFFSET)
#define IMXRT_SNVS_HPTAMR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPTAMR_OFFSET)
#define IMXRT_SNVS_HPTALR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPTALR_OFFSET)
#define IMXRT_SNVS_LPLR                 (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPLR_OFFSET)
#define IMXRT_SNVS_LPCR                 (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPCR_OFFSET)
#define IMXRT_SNVS_LPMKCR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPMKCR_OFFSET)
#define IMXRT_SNVS_LPSVCR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPSVCR_OFFSET)
#define IMXRT_SNVS_LPTGFCR              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPTGFCR_OFFSET)
#define IMXRT_SNVS_LPTDCR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPTDCR_OFFSET)
#define IMXRT_SNVS_LPSR                 (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPSR_OFFSET)
#define IMXRT_SNVS_LPSRTCMR             (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPSRTCMR_OFFSET)
#define IMXRT_SNVS_LPSRTCLR             (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPSRTCLR_OFFSET)
#define IMXRT_SNVS_LPTAR                (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPTAR_OFFSET)
#define IMXRT_SNVS_LPSMCMR              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPSMCMR_OFFSET)
#define IMXRT_SNVS_LPSMCLR              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPSMCLR_OFFSET)
#define IMXRT_SNVS_LPLVDR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPLVDR_OFFSET)
#define IMXRT_SNVS_LPGPR0_LEGACY_ALIAS  (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPGPR0_LEGACY_ALIAS_OFFSET)
#define IMXRT_SNVS_LPTDC2R              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPTDC2R_OFFSET)
#define IMXRT_SNVS_LPTDSR               (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPTDSR_OFFSET)
#define IMXRT_SNVS_LPTGF1CR             (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPTGF1CR_OFFSET)
#define IMXRT_SNVS_LPTGF2CR             (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPTGF2CR_OFFSET)
#define IMXRT_SNVS_LPAT1CR              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPAT1CR_OFFSET)
#define IMXRT_SNVS_LPAT2CR              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPAT2CR_OFFSET)
#define IMXRT_SNVS_LPAT3CR              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPAT3CR_OFFSET)
#define IMXRT_SNVS_LPAT4CR              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPAT4CR_OFFSET)
#define IMXRT_SNVS_LPAT5CR              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPAT5CR_OFFSET)
#define IMXRT_SNVS_LPATCTLR             (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPATCTLR_OFFSET)
#define IMXRT_SNVS_LPATCLKR             (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPATCLKR_OFFSET)
#define IMXRT_SNVS_LPATRC1R             (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPATRC1R_OFFSET)
#define IMXRT_SNVS_LPATRC2R             (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPATRC2R_OFFSET)
#define IMXRT_SNVS_HPVIDR1              (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPVIDR1_OFFSET)
#define IMXRT_SNVS_HPVIDR2              (IMXRT_ANADIG_BASE + IMXRT_SNVS_HPVIDR2_OFFSET)
#define IMXRT_SNVS_LPZMKR0              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPZMKR0_OFFSET)
#define IMXRT_SNVS_LPZMKR1              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPZMKR1_OFFSET)
#define IMXRT_SNVS_LPZMKR2              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPZMKR2_OFFSET)
#define IMXRT_SNVS_LPZMKR3              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPZMKR3_OFFSET)
#define IMXRT_SNVS_LPZMKR4              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPZMKR4_OFFSET)
#define IMXRT_SNVS_LPZMKR5              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPZMKR5_OFFSET)
#define IMXRT_SNVS_LPZMKR6              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPZMKR6_OFFSET)
#define IMXRT_SNVS_LPZMKR7              (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPZMKR7_OFFSET)
#define IMXRT_SNVS_LPGPR_ALIAS0         (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPGPR_ALIAS0_OFFSET)
#define IMXRT_SNVS_LPGPR_ALIAS1         (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPGPR_ALIAS1_OFFSET)
#define IMXRT_SNVS_LPGPR_ALIAS2         (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPGPR_ALIAS2_OFFSET)
#define IMXRT_SNVS_LPGPR_ALIAS3         (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPGPR_ALIAS3_OFFSET)
#define IMXRT_SNVS_LPGPR0               (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPGPR0_OFFSET)
#define IMXRT_SNVS_LPGPR1               (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPGPR1_OFFSET)
#define IMXRT_SNVS_LPGPR2               (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPGPR2_OFFSET)
#define IMXRT_SNVS_LPGPR3               (IMXRT_ANADIG_BASE + IMXRT_SNVS_LPGPR3_OFFSET)

/* SNVS_HP Lock Register (HPLR) */
#define SNVS_HPLR_ZMK_WSL     (1 << 0)   /* Bit 0: Zeroizable Master Key Write Soft Lock When set, prevents any writes (software and hardware) to the ZMK registers and the ZMK_HWP, ZMK_VAL, and ZMK_ECC_EN fields of the LPMKCR */
#define SNVS_HPLR_ZMK_RSL     (1 << 1)   /* Bit 1: Zeroizable Master Key Read Soft Lock When set, prevents any software reads to the ZMK Registers and ZMK_ECC_VALUE field of the LPMKCR */
#define SNVS_HPLR_SRTC_SL     (1 << 2)   /* Bit 2: Secure Real Time Counter Soft Lock When set, prevents any writes to the SRTC Registers, SRTC_ENV, and SRTC_INV_EN bits */
#define SNVS_HPLR_LPCALB_SL   (1 << 3)   /* Bit 3: LP Calibration Soft Lock When set, prevents any writes to the LP Calibration Value (LPCALB_VAL) and LP Calibration Enable (LPCALB_EN) */
#define SNVS_HPLR_MC_SL       (1 << 4)   /* Bit 4: Monotonic Counter Soft Lock When set, prevents any writes (increments) to the MC Registers and MC_ENV bit */
#define SNVS_HPLR_GPR_SL      (1 << 5)   /* Bit 5: General Purpose Register Soft Lock When set, prevents any writes to the GPR */
#define SNVS_HPLR_LPSVCR_SL   (1 << 6)   /* Bit 6: LP Security Violation Control Register Soft Lock When set, prevents any writes to the LPSVCR */
#define SNVS_HPLR_LPTGFCR_SL  (1 << 7)   /* Bit 7: LP Tamper Glitch Filter Configuration Register Soft Lock When set, prevents any writes to the LPTGFCR */
#define SNVS_HPLR_LPSECR_SL   (1 << 8)   /* Bit 8: LP Security Events Configuration Register Soft Lock When set, prevents any writes to the LPSECR */
#define SNVS_HPLR_MKS_SL      (1 << 9)   /* Bit 9: Master Key Select Soft Lock When set, prevents any writes to the MASTER_KEY_SEL field of the LPMKCR */
#define SNVS_HPLR_HPSVCR_L    (1 << 16)  /* Bit 16: HP Security Violation Control Register Lock When set, prevents any writes to the HPSVCR */
#define SNVS_HPLR_HPSICR_L    (1 << 17)  /* Bit 17: HP Security Interrupt Control Register Lock When set, prevents any writes to the HPSICR */
#define SNVS_HPLR_HAC_L       (1 << 18)  /* Bit 18: High Assurance Counter Lock When set, prevents any writes to HPHACIVR, HPHACR, and HAC_EN bit of HPCOMR */
#define SNVS_HPLR_AT1_SL      (1 << 24)  /* Bit 24: Active Tamper 1 Soft Lock When set, prevents any writes to the Active Tamper 1 registers */
#define SNVS_HPLR_AT2_SL      (1 << 25)  /* Bit 25: Active Tamper 2 Soft Lock When set, prevents any writes to the Active Tamper 2 registers */
#define SNVS_HPLR_AT3_SL      (1 << 26)  /* Bit 26: Active Tamper 3 Soft Lock When set, prevents any writes to the Active Tamper 3 registers */
#define SNVS_HPLR_AT4_SL      (1 << 27)  /* Bit 27: Active Tamper 4 Soft Lock When set, prevents any writes to the Active Tamper 4 registers */
#define SNVS_HPLR_AT5_SL      (1 << 28)  /* Bit 28: Active Tamper 5 Soft Lock When set, prevents any writes to the Active Tamper 5 registers */

/* SNVS_HP Command Register (HPCOMR) */
#define SNVS_HPCOMR_SSM_ST        (1 << 0)   /* Bit 0: SSM State Transition Transition state of the system security monitor */
#define SNVS_HPCOMR_SSM_ST_DIS    (1 << 1)   /* Bit 1: SSM Secure to Trusted State Transition Disable When set, disables the SSM transition from secure to trusted state */
#define SNVS_HPCOMR_SSM_SFNS_DIS  (1 << 2)   /* Bit 2: SSM Soft Fail to Non-Secure State Transition Disable When set, it disables the SSM transition from soft fail to non-secure state */
#define SNVS_HPCOMR_LP_SWR        (1 << 4)   /* Bit 4: LP Software Reset When set to 1, most registers in the SNVS_LP section are reset, but the following registers are not reset by an LP software reset: Monotonic Counter Secure Real Time Counter Time Alarm Register This bit cannot be set when the LP_SWR_DIS bit is set */
#define SNVS_HPCOMR_LP_SWR_DIS    (1 << 5)   /* Bit 5: LP Software Reset Disable When set, disables the LP software reset */
#define SNVS_HPCOMR_SW_SV         (1 << 8)   /* Bit 8: Software Security Violation When set, the system security monitor treats this bit as a non-fatal security violation */
#define SNVS_HPCOMR_SW_FSV        (1 << 9)   /* Bit 9: Software Fatal Security Violation When set, the system security monitor treats this bit as a fatal security violation */
#define SNVS_HPCOMR_SW_LPSV       (1 << 10)  /* Bit 10: LP Software Security Violation When set, SNVS_LP treats this bit as a security violation */
#define SNVS_HPCOMR_PROG_ZMK      (1 << 12)  /* Bit 12: Program Zeroizable Master Key This bit activates ZMK hardware programming mechanism */
#define SNVS_HPCOMR_MKS_EN        (1 << 13)  /* Bit 13: Master Key Select Enable When not set, the one time programmable (OTP) master key is selected by default */
#define SNVS_HPCOMR_HAC_EN        (1 << 16)  /* Bit 16: High Assurance Counter Enable This bit controls the SSM transition from the soft fail to the hard fail state */
#define SNVS_HPCOMR_HAC_LOAD      (1 << 17)  /* Bit 17: High Assurance Counter Load When set, it loads the High Assurance Counter Register with the value of the High Assurance Counter Load Register */
#define SNVS_HPCOMR_HAC_CLEAR     (1 << 18)  /* Bit 18: High Assurance Counter Clear When set, it clears the High Assurance Counter Register */
#define SNVS_HPCOMR_HAC_STOP      (1 << 19)  /* Bit 19: High Assurance Counter Stop This bit can be set only when SSM is in soft fail state */
#define SNVS_HPCOMR_NPSWA_EN      (1 << 31)  /* Bit 31: Non-Privileged Software Access Enable When set, allows non-privileged software to access all SNVS registers, including those that are privileged software read/write access only */

/* SNVS_HP Control Register (HPCR) */
#define SNVS_HPCR_RTC_EN            (1 << 0)   /* Bit 0: HP Real Time Counter Enable */
#define SNVS_HPCR_HPTA_EN           (1 << 1)   /* Bit 1: HP Time Alarm Enable When set, the time alarm interrupt is generated if the value in the HP Time Alarm Registers is equal to the value of the HP Real Time Counter */
#define SNVS_HPCR_DIS_PI            (1 << 2)   /* Bit 2: Disable periodic interrupt in the functional interrupt */
#define SNVS_HPCR_PI_EN             (1 << 3)   /* Bit 3: HP Periodic Interrupt Enable The periodic interrupt can be generated only if the HP Real Time Counter is enabled */
#define SNVS_HPCR_PI_FREQ_SHIFT     (4)        /* Bits 4-8: Periodic Interrupt Frequency Defines frequency of the periodic interrupt */
#define SNVS_HPCR_PI_FREQ_MASK      (0xF << SNVS_HPCR_PI_FREQ_SHIFT)
#define SNVS_HPCR_PI_FREQ(n)        (((n) << SNVS_HPCR_PI_FREQ_SHIFT) & SNVS_HPCR_PI_FREQ_MASK)
#define SNVS_HPCR_HPCALB_EN         (1 << 8)   /* Bit 8: HP Real Time Counter Calibration Enabled Indicates that the time calibration mechanism is enabled. */
#define SNVS_HPCR_HPCALB_VAL_SHIFT  (10)       /* Bits 10-15: HP Calibration Value Defines signed calibration value for the HP Real Time Counter */
#define SNVS_HPCR_HPCALB_VAL_MASK   (0x1F << SNVS_HPCR_HPCALB_VAL_SHIFT)
#define SNVS_HPCR_HPCALB_VAL(n)     (((n) << SNVS_HPCR_HPCALB_VAL_SHIFT) & SNVS_HPCR_HPCALB_VAL_MASK)
#define SNVS_HPCR_HP_TS             (1 << 16)  /* Bit 16: HP Time Synchronize */
#define SNVS_HPCR_BTN_CONFIG_SHIFT  (24)       /* Bits 24-27: Button Configuration */
#define SNVS_HPCR_BTN_CONFIG_MASK   (0x7 << SNVS_HPCR_BTN_CONFIG_SHIFT)
#define SNVS_HPCR_BTN_CONFIG(n)     (((n) << SNVS_HPCR_BTN_CONFIG_SHIFT) & SNVS_HPCR_BTN_CONFIG_MASK)
#define SNVS_HPCR_BTN_MASK          (1 << 27)  /* Bit 27: Button interrupt mask */

