apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_snvs.h
/* SNVS_HP Security Interrupt Control Register (HPSICR) */
#define SNVS_HPSICR_CAAM_EN   (1 << 0)   /* Bit 0: CAAM Security Violation Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the CAAM Security Violation security violation */
#define SNVS_HPSICR_JTAGC_EN  (1 << 1)   /* Bit 1: JTAG Active Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the JTAG Active security violation */
#define SNVS_HPSICR_WDOG2_EN  (1 << 2)   /* Bit 2: Watchdog 2 Reset Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Watchdog 2 Reset security violation */
#define SNVS_HPSICR_SRC_EN    (1 << 4)   /* Bit 4: Internal Boot Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Internal Boot security violation */
#define SNVS_HPSICR_OCOTP_EN  (1 << 5)   /* Bit 5: OCOTP attack error Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the OCOTP attack error security violation */
#define SNVS_HPSICR_LPSVI_EN  (1 << 31)  /* Bit 31: LP Security Violation Interrupt Enable This bit enables generating of the security interrupt to the host processor upon security violation signal from the LP section */

/* SNVS_HP Security Violation Control Register (HPSVCR) */
#define SNVS_HPSVCR_CAAM_CFG         (1 << 0)  /* Bit 0: CAAM Security Violation Security Violation Configuration This field configures the CAAM Security Violation Security Violation Input */
#define SNVS_HPSVCR_JTAGC_CFG        (1 << 1)  /* Bit 1: JTAG Active Security Violation Configuration This field configures the JTAG Active Security Violation Input */
#define SNVS_HPSVCR_WDOG2_CFG        (1 << 2)  /* Bit 2: Watchdog 2 Reset Security Violation Configuration This field configures the Watchdog 2 Reset Security Violation Input */
#define SNVS_HPSVCR_SRC_CFG          (1 << 4)  /* Bit 4: Internal Boot Security Violation Configuration This field configures the Internal Boot Security Violation Input */
#define SNVS_HPSVCR_OCOTP_CFG_SHIFT  (5)       /* Bits 5-7: OCOTP attack error Security Violation Configuration This field configures the OCOTP attack error Security Violation Input */
#define SNVS_HPSVCR_OCOTP_CFG_MASK   (0x3 << SNVS_HPSVCR_OCOTP_CFG_SHIFT)
#define SNVS_HPSVCR_OCOTP_CFG(n)     (((n) << SNVS_HPSVCR_OCOTP_CFG_SHIFT) & SNVS_HPSVCR_OCOTP_CFG_MASK)
#define SNVS_HPSVCR_LPSV_CFG_SHIFT   (30)      /* Bits 30-32: LP Security Violation Configuration This field configures the LP security violation source. */
#define SNVS_HPSVCR_LPSV_CFG_MASK    (0x3 << SNVS_HPSVCR_LPSV_CFG_SHIFT)
#define SNVS_HPSVCR_LPSV_CFG(n)      (((n) << SNVS_HPSVCR_LPSV_CFG_SHIFT) & SNVS_HPSVCR_LPSV_CFG_MASK)

/* SNVS_HP Status Register (HPSR) */
#define SNVS_HPSR_HPTA                    (1 << 0)   /* Bit 0: HP Time Alarm Indicates that the HP Time Alarm has occurred since this bit was last cleared. */
#define SNVS_HPSR_PI                      (1 << 1)   /* Bit 1: Periodic Interrupt Indicates that periodic interrupt has occurred since this bit was last cleared. */
#define SNVS_HPSR_LPDIS                   (1 << 4)   /* Bit 4: Low Power Disable If 1, the low power section has been disabled by means of an input signal to SNVS */
#define SNVS_HPSR_BTN                     (1 << 6)   /* Bit 6: Button Value of the BTN input */
#define SNVS_HPSR_BI                      (1 << 7)   /* Bit 7: Button Interrupt Signal ipi_snvs_btn_int_b was asserted. */
#define SNVS_HPSR_SSM_STATE_SHIFT         (8)        /* Bits 8-12: System Security Monitor State This field contains the encoded state of the SSM's state machine */
#define SNVS_HPSR_SSM_STATE_MASK          (0xF << SNVS_HPSR_SSM_STATE_SHIFT)
#define SNVS_HPSR_SSM_STATE(n)            (((n) << SNVS_HPSR_SSM_STATE_SHIFT) & SNVS_HPSR_SSM_STATE_MASK)
#define SNVS_HPSR_SYS_SECURITY_CFG_SHIFT  (12)       /* Bits 12-15: System Security Configuration This field reflects the three security configuration inputs to SNVS */
#define SNVS_HPSR_SYS_SECURITY_CFG_MASK   (0x7 << SNVS_HPSR_SYS_SECURITY_CFG_SHIFT)
#define SNVS_HPSR_SYS_SECURITY_CFG(n)     (((n) << SNVS_HPSR_SYS_SECURITY_CFG_SHIFT) & SNVS_HPSR_SYS_SECURITY_CFG_MASK)
#define SNVS_HPSR_SYS_SECURE_BOOT         (1 << 15)  /* Bit 15: System Secure Boot If SYS_SECURE_BOOT is 1, the chip boots from internal ROM */
#define SNVS_HPSR_OTPMK_ZERO              (1 << 27)  /* Bit 27: One Time Programmable Master Key is Equal to Zero */
#define SNVS_HPSR_ZMK_ZERO                (1 << 31)  /* Bit 31: Zeroizable Master Key is Equal to Zero */

/* SNVS_HP Security Violation Status Register (HPSVSR) */
#define SNVS_HPSVSR_CAAM                (1 << 0)   /* Bit 0: CAAM Security Violation security violation was detected. */
#define SNVS_HPSVSR_JTAGC               (1 << 1)   /* Bit 1: JTAG Active security violation was detected. */
#define SNVS_HPSVSR_WDOG2               (1 << 2)   /* Bit 2: Watchdog 2 Reset security violation was detected. */
#define SNVS_HPSVSR_SRC                 (1 << 4)   /* Bit 4: Internal Boot security violation was detected. */
#define SNVS_HPSVSR_OCOTP               (1 << 5)   /* Bit 5: OCOTP attack error security violation was detected. */
#define SNVS_HPSVSR_SW_SV               (1 << 13)  /* Bit 13: Software Security Violation This bit is a read-only copy of the SW_SV bit in the HP Command Register */
#define SNVS_HPSVSR_SW_FSV              (1 << 14)  /* Bit 14: Software Fatal Security Violation This bit is a read-only copy of the SW_FSV bit in the HP Command Register */
#define SNVS_HPSVSR_SW_LPSV             (1 << 15)  /* Bit 15: LP Software Security Violation This bit is a read-only copy of the SW_LPSV bit in the HP Command Register */
#define SNVS_HPSVSR_ZMK_SYNDROME_SHIFT  (16)       /* Bits 16-25: Zeroizable Master Key Syndrome The ZMK syndrome indicates the single-bit error location and parity for the ZMK register */
#define SNVS_HPSVSR_ZMK_SYNDROME_MASK   (0x1FF << SNVS_HPSVSR_ZMK_SYNDROME_SHIFT)
#define SNVS_HPSVSR_ZMK_SYNDROME(n)     (((n) << SNVS_HPSVSR_ZMK_SYNDROME_SHIFT) & SNVS_HPSVSR_ZMK_SYNDROME_MASK)
#define SNVS_HPSVSR_ZMK_ECC_FAIL        (1 << 27)  /* Bit 27: Zeroizable Master Key Error Correcting Code Check Failure When set, this bit triggers a bad key violation to the SSM and a security violation to the SNVS_LP section, which clears security sensitive data */
#define SNVS_HPSVSR_LP_SEC_VIO          (1 << 31)  /* Bit 31: LP Security Violation A security volation was detected in the SNVS low power section */

/* SNVS_HP High Assurance Counter IV Register (HPHACIVR) */
#define SNVS_HPHACIVR_HAC_COUNTER_IV_SHIFT  (0)  /* Bits 0-32: High Assurance Counter Initial Value This register is used to set the starting count value to the high assurance counter */
#define SNVS_HPHACIVR_HAC_COUNTER_IV_MASK   (0xFFFFFFFF << SNVS_HPHACIVR_HAC_COUNTER_IV_SHIFT)
#define SNVS_HPHACIVR_HAC_COUNTER_IV(n)     (((n) << SNVS_HPHACIVR_HAC_COUNTER_IV_SHIFT) & SNVS_HPHACIVR_HAC_COUNTER_IV_MASK)

/* SNVS_HP High Assurance Counter Register (HPHACR) */
#define SNVS_HPHACR_HAC_COUNTER_SHIFT  (0)  /* Bits 0-32: High Assurance Counter When the HAC_EN bit is set and the SSM is in the soft fail state, this counter starts to count down with the system clock */
#define SNVS_HPHACR_HAC_COUNTER_MASK   (0xFFFFFFFF << SNVS_HPHACR_HAC_COUNTER_SHIFT)
#define SNVS_HPHACR_HAC_COUNTER(n)     (((n) << SNVS_HPHACR_HAC_COUNTER_SHIFT) & SNVS_HPHACR_HAC_COUNTER_MASK)

