apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_snvs.h
/* SNVS_HP Real Time Counter MSB Register (HPRTCMR) */
#define SNVS_HPRTCMR_RTC_SHIFT  (0)  /* Bits 0-15: HP Real Time Counter The most-significant 15 bits of the RTC */
#define SNVS_HPRTCMR_RTC_MASK   (0x7FFF << SNVS_HPRTCMR_RTC_SHIFT)
#define SNVS_HPRTCMR_RTC(n)     (((n) << SNVS_HPRTCMR_RTC_SHIFT) & SNVS_HPRTCMR_RTC_MASK)

/* SNVS_HP Real Time Counter LSB Register (HPRTCLR) */
#define SNVS_HPRTCLR_RTC_SHIFT  (0)  /* Bits 0-32: HP Real Time Counter least-significant 32 bits */
#define SNVS_HPRTCLR_RTC_MASK   (0xFFFFFFFF << SNVS_HPRTCLR_RTC_SHIFT)
#define SNVS_HPRTCLR_RTC(n)     (((n) << SNVS_HPRTCLR_RTC_SHIFT) & SNVS_HPRTCLR_RTC_MASK)

/* SNVS_HP Time Alarm MSB Register (HPTAMR) */
#define SNVS_HPTAMR_HPTA_MS_SHIFT  (0)  /* Bits 0-15: HP Time Alarm, most-significant 15 bits */
#define SNVS_HPTAMR_HPTA_MS_MASK   (0x7FFF << SNVS_HPTAMR_HPTA_MS_SHIFT)
#define SNVS_HPTAMR_HPTA_MS(n)     (((n) << SNVS_HPTAMR_HPTA_MS_SHIFT) & SNVS_HPTAMR_HPTA_MS_MASK)

/* SNVS_HP Time Alarm LSB Register (HPTALR) */
#define SNVS_HPTALR_HPTA_LS_SHIFT  (0)  /* Bits 0-32: HP Time Alarm, 32 least-significant bits */
#define SNVS_HPTALR_HPTA_LS_MASK   (0xFFFFFFFF << SNVS_HPTALR_HPTA_LS_SHIFT)
#define SNVS_HPTALR_HPTA_LS(n)     (((n) << SNVS_HPTALR_HPTA_LS_SHIFT) & SNVS_HPTALR_HPTA_LS_MASK)

/* SNVS_LP Lock Register (LPLR) */
#define SNVS_LPLR_ZMK_WHL     (1 << 0)   /* Bit 0: Zeroizable Master Key Write Hard Lock When set, prevents any writes (software and hardware) to the ZMK registers and ZMK_HWP, ZMK_VAL, and ZMK_ECC_EN fields of the LPMKCR */
#define SNVS_LPLR_ZMK_RHL     (1 << 1)   /* Bit 1: Zeroizable Master Key Read Hard Lock When set, prevents any software reads to the ZMK registers and ZMK_ECC_VALUE field of the LPMKCR */
#define SNVS_LPLR_SRTC_HL     (1 << 2)   /* Bit 2: Secure Real Time Counter Hard Lock When set, prevents any writes to the SRTC registers, SRTC_ENV, and SRTC_INV_EN bits */
#define SNVS_LPLR_LPCALB_HL   (1 << 3)   /* Bit 3: LP Calibration Hard Lock When set, prevents any writes to the LP Calibration Value (LPCALB_VAL) and LP Calibration Enable (LPCALB_EN) */
#define SNVS_LPLR_MC_HL       (1 << 4)   /* Bit 4: Monotonic Counter Hard Lock When set, prevents any writes (increments) to the MC Registers and MC_ENV bit */
#define SNVS_LPLR_GPR_HL      (1 << 5)   /* Bit 5: General Purpose Register Hard Lock When set, prevents any writes to the GPR */
#define SNVS_LPLR_LPSVCR_HL   (1 << 6)   /* Bit 6: LP Security Violation Control Register Hard Lock When set, prevents any writes to the LPSVCR */
#define SNVS_LPLR_LPTGFCR_HL  (1 << 7)   /* Bit 7: LP Tamper Glitch Filter Configuration Register Hard Lock When set, prevents any writes to the LPTGFCR */
#define SNVS_LPLR_LPSECR_HL   (1 << 8)   /* Bit 8: LP Security Events Configuration Register Hard Lock When set, prevents any writes to the LPSECR */
#define SNVS_LPLR_MKS_HL      (1 << 9)   /* Bit 9: Master Key Select Hard Lock When set, prevents any writes to the MASTER_KEY_SEL field of the LP Master Key Control Register */
#define SNVS_LPLR_AT1_HL      (1 << 24)  /* Bit 24: Active Tamper 1 Hard Lock When set, prevents any writes to the Active Tamper 1 registers */
#define SNVS_LPLR_AT2_HL      (1 << 25)  /* Bit 25: Active Tamper 2 Hard Lock When set, prevents any writes to the Active Tamper 2 registers */
#define SNVS_LPLR_AT3_HL      (1 << 26)  /* Bit 26: Active Tamper 3 Hard Lock When set, prevents any writes to the Active Tamper 3 registers */
#define SNVS_LPLR_AT4_HL      (1 << 27)  /* Bit 27: Active Tamper 4 Hard Lock When set, prevents any writes to the Active Tamper 4 registers */
#define SNVS_LPLR_AT5_HL      (1 << 28)  /* Bit 28: Active Tamper 5 Hard Lock When set, prevents any writes to the Active Tamper 5 registers */

/* SNVS_LP Control Register (LPCR) */
#define SNVS_LPCR_SRTC_ENV              (1 << 0)   /* Bit 0: Secure Real Time Counter Enabled and Valid When set, the SRTC becomes operational */
#define SNVS_LPCR_LPTA_EN               (1 << 1)   /* Bit 1: LP Time Alarm Enable When set, the SNVS functional interrupt is asserted if the LP Time Alarm Register is equal to the 32 MSBs of the secure real time counter */
#define SNVS_LPCR_MC_ENV                (1 << 2)   /* Bit 2: Monotonic Counter Enabled and Valid When set, the MC can be incremented (by write transaction to the LPSMCMR or LPSMCLR) */
#define SNVS_LPCR_LPWUI_EN              (1 << 3)   /* Bit 3: LP Wake-Up Interrupt Enable This interrupt line should be connected to the external pin and is intended to inform the external chip about an SNVS_LP event (tamper event, MC rollover, SRTC rollover, or time alarm ) */
#define SNVS_LPCR_SRTC_INV_EN           (1 << 4)   /* Bit 4: If this bit is 1, in the case of a security violation the SRTC stops counting and the SRTC is invalidated (SRTC_ENV bit is cleared) */
#define SNVS_LPCR_DP_EN                 (1 << 5)   /* Bit 5: Dumb PMIC Enabled When set, software can control the system power */
#define SNVS_LPCR_TOP                   (1 << 6)   /* Bit 6: Turn off System Power Asserting this bit causes a signal to be sent to the Power Management IC to turn off the system power */
#define SNVS_LPCR_LVD_EN                (1 << 7)   /* Bit 7: Digital Low-Voltage Event Enable By default the detection of a low-voltage event does not cause the pmic_en_b signal to be asserted */
#define SNVS_LPCR_LPCALB_EN             (1 << 8)   /* Bit 8: LP Calibration Enable When set, enables the SRTC calibration mechanism */
#define SNVS_LPCR_LPCALB_VAL_SHIFT      (10)       /* Bits 10-15: LP Calibration Value Defines signed calibration value for SRTC */
#define SNVS_LPCR_LPCALB_VAL_MASK       (0x1F << SNVS_LPCR_LPCALB_VAL_SHIFT)
#define SNVS_LPCR_LPCALB_VAL(n)         (((n) << SNVS_LPCR_LPCALB_VAL_SHIFT) & SNVS_LPCR_LPCALB_VAL_MASK)
#define SNVS_LPCR_BTN_PRESS_TIME_SHIFT  (16)       /* Bits 16-18: This field configures the button press time out values for the PMIC Logic */
#define SNVS_LPCR_BTN_PRESS_TIME_MASK   (0x3 << SNVS_LPCR_BTN_PRESS_TIME_SHIFT)
#define SNVS_LPCR_BTN_PRESS_TIME(n)     (((n) << SNVS_LPCR_BTN_PRESS_TIME_SHIFT) & SNVS_LPCR_BTN_PRESS_TIME_MASK)
#define SNVS_LPCR_DEBOUNCE_SHIFT        (18)       /* Bits 18-20: This field configures the amount of debounce time for the BTN input signal */
#define SNVS_LPCR_DEBOUNCE_MASK         (0x3 << SNVS_LPCR_DEBOUNCE_SHIFT)
#define SNVS_LPCR_DEBOUNCE(n)           (((n) << SNVS_LPCR_DEBOUNCE_SHIFT) & SNVS_LPCR_DEBOUNCE_MASK)
#define SNVS_LPCR_ON_TIME_SHIFT         (20)       /* Bits 20-22: The ON_TIME field is used to configure the period of time after BTN is asserted before pmic_en_b is asserted to turn on the SoC power */
#define SNVS_LPCR_ON_TIME_MASK          (0x3 << SNVS_LPCR_ON_TIME_SHIFT)
#define SNVS_LPCR_ON_TIME(n)            (((n) << SNVS_LPCR_ON_TIME_SHIFT) & SNVS_LPCR_ON_TIME_MASK)
#define SNVS_LPCR_PK_EN                 (1 << 22)  /* Bit 22: PMIC On Request Enable The value written to PK_EN will be asserted on output signal snvs_lp_pk_en */
#define SNVS_LPCR_PK_OVERRIDE           (1 << 23)  /* Bit 23: PMIC On Request Override The value written to PK_OVERRIDE will be asserted on output signal snvs_lp_pk_override */
#define SNVS_LPCR_GPR_Z_DIS             (1 << 24)  /* Bit 24: General Purpose Registers Zeroization Disable */

