apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_snvs.h
/* SNVS_LP Master Key Control Register (LPMKCR) */
#define SNVS_LPMKCR_MASTER_KEY_SEL_SHIFT  (0)       /* Bits 0-2: Master Key Select These bits select the SNVS Master Key output when Master Key Select bits are enabled by MKS_EN bit in the HPCOMR */
#define SNVS_LPMKCR_MASTER_KEY_SEL_MASK   (0x3 << SNVS_LPMKCR_MASTER_KEY_SEL_SHIFT)
#define SNVS_LPMKCR_MASTER_KEY_SEL(n)     (((n) << SNVS_LPMKCR_MASTER_KEY_SEL_SHIFT) & SNVS_LPMKCR_MASTER_KEY_SEL_MASK)
#define SNVS_LPMKCR_ZMK_HWP               (1 << 2)  /* Bit 2: Zeroizable Master Key hardware Programming mode When set, only the hardware key programming mechanism can set the ZMK and software cannot read it */
#define SNVS_LPMKCR_ZMK_VAL               (1 << 3)  /* Bit 3: Zeroizable Master Key Valid When set, the ZMK value can be selected by the master key control block for use by cryptographic modules */
#define SNVS_LPMKCR_ZMK_ECC_EN            (1 << 4)  /* Bit 4: Zeroizable Master Key Error Correcting Code Check Enable Writing one to this field automatically calculates and sets the ZMK ECC value in the ZMK_ECC_VALUE field of this register */
#define SNVS_LPMKCR_ZMK_ECC_VALUE_SHIFT   (7)       /* Bits 7-16: Zeroizable Master Key Error Correcting Code Value This field is automatically calculated and set when one is written into ZMK_ECC_EN bit of this register */
#define SNVS_LPMKCR_ZMK_ECC_VALUE_MASK    (0x1FF << SNVS_LPMKCR_ZMK_ECC_VALUE_SHIFT)
#define SNVS_LPMKCR_ZMK_ECC_VALUE(n)      (((n) << SNVS_LPMKCR_ZMK_ECC_VALUE_SHIFT) & SNVS_LPMKCR_ZMK_ECC_VALUE_MASK)

/* SNVS_LP Security Violation Control Register (LPSVCR) */
#define SNVS_LPSVCR_CAAM_EN   (1 << 0)  /* Bit 0: CAAM Security Violation Enable This bit enables CAAM Security Violation Input */
#define SNVS_LPSVCR_JTAGC_EN  (1 << 1)  /* Bit 1: JTAG Active Enable This bit enables JTAG Active Input */
#define SNVS_LPSVCR_WDOG2_EN  (1 << 2)  /* Bit 2: Watchdog 2 Reset Enable This bit enables Watchdog 2 Reset Input */
#define SNVS_LPSVCR_SRC_EN    (1 << 4)  /* Bit 4: Internal Boot Enable This bit enables Internal Boot Input */
#define SNVS_LPSVCR_OCOTP_EN  (1 << 5)  /* Bit 5: OCOTP attack error Enable This bit enables OCOTP attack error Input */

/* SNVS_LP Tamper Glitch Filters Configuration Register (LPTGFCR) */
#define SNVS_LPTGFCR_WMTGF_SHIFT  (0)        /* Bits 0-5: Wire-Mesh Tamper Glitch Filter Configures the length of the digital glitch filter for the wire-mesh tamper 1 and 2 pins between 1 and 63 SRTC clock cycles */
#define SNVS_LPTGFCR_WMTGF_MASK   (0x1F << SNVS_LPTGFCR_WMTGF_SHIFT)
#define SNVS_LPTGFCR_WMTGF(n)     (((n) << SNVS_LPTGFCR_WMTGF_SHIFT) & SNVS_LPTGFCR_WMTGF_MASK)
#define SNVS_LPTGFCR_WMTGF_EN     (1 << 7)   /* Bit 7: Wire-Mesh Tamper Glitch Filter Enable When set, enables the wire-mesh tamper glitch filter */
#define SNVS_LPTGFCR_ETGF1_SHIFT  (16)       /* Bits 16-23: External Tamper Glitch Filter 1 Configures the length of the digital glitch filter for the external tamper 1 pin between 128 and 32640 SRTC clock cycles */
#define SNVS_LPTGFCR_ETGF1_MASK   (0x7F << SNVS_LPTGFCR_ETGF1_SHIFT)
#define SNVS_LPTGFCR_ETGF1(n)     (((n) << SNVS_LPTGFCR_ETGF1_SHIFT) & SNVS_LPTGFCR_ETGF1_MASK)
#define SNVS_LPTGFCR_ETGF1_EN     (1 << 23)  /* Bit 23: External Tamper Glitch Filter 1 Enable When set, enables the external tamper glitch filter 1. */
#define SNVS_LPTGFCR_ETGF2_SHIFT  (24)       /* Bits 24-31: External Tamper Glitch Filter 2 Configures the length of the digital glitch filter for the external tamper 2 pin between 128 and 32640 SRTC clock cycles */
#define SNVS_LPTGFCR_ETGF2_MASK   (0x7F << SNVS_LPTGFCR_ETGF2_SHIFT)
#define SNVS_LPTGFCR_ETGF2(n)     (((n) << SNVS_LPTGFCR_ETGF2_SHIFT) & SNVS_LPTGFCR_ETGF2_MASK)
#define SNVS_LPTGFCR_ETGF2_EN     (1 << 31)  /* Bit 31: External Tamper Glitch Filter 2 Enable When set, enables the external tamper glitch filter 2. */

/* SNVS_LP Tamper Detect Configuration Register (LPTDCR) */
#define SNVS_LPTDCR_SRTCR_EN    (1 << 1)   /* Bit 1: SRTC Rollover Enable When set, an SRTC rollover event generates an LP security violation. */
#define SNVS_LPTDCR_MCR_EN      (1 << 2)   /* Bit 2: MC Rollover Enable When set, an MC Rollover event generates an LP security violation. */
#define SNVS_LPTDCR_CT_EN       (1 << 4)   /* Bit 4: Clock Tamper Enable When set, a clock monitor tamper generates an LP security violation. */
#define SNVS_LPTDCR_TT_EN       (1 << 5)   /* Bit 5: Temperature Tamper Enable When set, a temperature monitor tamper generates an LP security violation */
#define SNVS_LPTDCR_VT_EN       (1 << 6)   /* Bit 6: Voltage Tamper Enable Voltage Tamper Enable should be enabled 500 us after setting SCSC_SOSC_CTR [VOLT_TEMP_TAMPER_EN] */
#define SNVS_LPTDCR_WMT1_EN     (1 << 7)   /* Bit 7: Wire-Mesh Tampering 1 Enable When set, wire-mesh tampering 1 detection generates an LP security violation */
#define SNVS_LPTDCR_WMT2_EN     (1 << 8)   /* Bit 8: Wire-Mesh Tampering 2 Enable When set, wire-mesh tampering 2 detection generates an LP security violation */
#define SNVS_LPTDCR_ET1_EN      (1 << 9)   /* Bit 9: External Tampering 1 Enable When set, external tampering 1 detection generates an LP security violation */
#define SNVS_LPTDCR_ET2_EN      (1 << 10)  /* Bit 10: External Tampering 2 Enable When set, external tampering 2 detection generates an LP security violation */
#define SNVS_LPTDCR_ET1P        (1 << 11)  /* Bit 11: External Tampering 1 Polarity This bit is used to determine the polarity of external tamper 1. */
#define SNVS_LPTDCR_ET2P        (1 << 12)  /* Bit 12: External Tampering 2 Polarity This bit is used to determine the polarity of external tamper 2. */
#define SNVS_LPTDCR_PFD_OBSERV  (1 << 14)  /* Bit 14: System Power Fail Detector (PFD) Observability Flop The asynchronous reset input of this flop is connected directly to the inverted output of the PFD analog circuitry (external to the SNVS block) */
#define SNVS_LPTDCR_POR_OBSERV  (1 << 15)  /* Bit 15: Power On Reset (POR) Observability Flop The asynchronous reset input of this flop is connected directly to the output of the POR analog circuitry (external to the SNVS */
#define SNVS_LPTDCR_LTDC_SHIFT  (16)       /* Bits 16-19: Low Temp Detect Configuration These configuration bits are wired as an output of the module. */
#define SNVS_LPTDCR_LTDC_MASK   (0x7 << SNVS_LPTDCR_LTDC_SHIFT)
#define SNVS_LPTDCR_LTDC(n)     (((n) << SNVS_LPTDCR_LTDC_SHIFT) & SNVS_LPTDCR_LTDC_MASK)
#define SNVS_LPTDCR_HTDC_SHIFT  (20)       /* Bits 20-23: High Temperature Detect Configuration These configuration bits are wired as an output of the module */
#define SNVS_LPTDCR_HTDC_MASK   (0x7 << SNVS_LPTDCR_HTDC_SHIFT)
#define SNVS_LPTDCR_HTDC(n)     (((n) << SNVS_LPTDCR_HTDC_SHIFT) & SNVS_LPTDCR_HTDC_MASK)
#define SNVS_LPTDCR_VRC_SHIFT   (24)       /* Bits 24-27: Voltage Reference Configuration These configuration bits are wired as an output of the module. */
#define SNVS_LPTDCR_VRC_MASK    (0x7 << SNVS_LPTDCR_VRC_SHIFT)
#define SNVS_LPTDCR_VRC(n)      (((n) << SNVS_LPTDCR_VRC_SHIFT) & SNVS_LPTDCR_VRC_MASK)
#define SNVS_LPTDCR_OSCB        (1 << 28)  /* Bit 28: Oscillator Bypass When OSCB=1 the osc_bypass signal is asserted */

