apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_snvs.h
/* SNVS_LP Status Register (LPSR) */
#define SNVS_LPSR_LPTA   (1 << 0)   /* Bit 0: LP Time Alarm */
#define SNVS_LPSR_SRTCR  (1 << 1)   /* Bit 1: Secure Real Time Counter Rollover */
#define SNVS_LPSR_MCR    (1 << 2)   /* Bit 2: Monotonic Counter Rollover */
#define SNVS_LPSR_LVD    (1 << 3)   /* Bit 3: Digital Low Voltage Event Detected */
#define SNVS_LPSR_CTD    (1 << 4)   /* Bit 4: Clock Tampering Detected */
#define SNVS_LPSR_TTD    (1 << 5)   /* Bit 5: Temperature Tamper Detected */
#define SNVS_LPSR_VTD    (1 << 6)   /* Bit 6: Voltage Tampering Detected */
#define SNVS_LPSR_WMT1D  (1 << 7)   /* Bit 7: Wire-Mesh Tampering 1 Detected */
#define SNVS_LPSR_WMT2D  (1 << 8)   /* Bit 8: Wire-Mesh Tampering 2 Detected */
#define SNVS_LPSR_ET1D   (1 << 9)   /* Bit 9: External Tampering 1 Detected */
#define SNVS_LPSR_ET2D   (1 << 10)  /* Bit 10: External Tampering 2 Detected */
#define SNVS_LPSR_ESVD   (1 << 16)  /* Bit 16: External Security Violation Detected Indicates that a security violation is detected on one of the HP security violation ports */
#define SNVS_LPSR_EO     (1 << 17)  /* Bit 17: Emergency Off This bit is set when a power off is requested. */
#define SNVS_LPSR_SPOF   (1 << 18)  /* Bit 18: Set Power Off The SPO bit is set when the power button is pressed longer than the configured debounce time */
#define SNVS_LPSR_LPNS   (1 << 30)  /* Bit 30: LP Section is Non-Secured Indicates that LP section was provisioned/programmed in the non-secure state */
#define SNVS_LPSR_LPS    (1 << 31)  /* Bit 31: LP Section is Secured Indicates that the LP section is provisioned/programmed in the secure or trusted state */

/* SNVS_LP Secure Real Time Counter MSB Register (LPSRTCMR) */
#define SNVS_LPSRTCMR_SRTC_SHIFT  (0)  /* Bits 0-15: LP Secure Real Time Counter The most-significant 15 bits of the SRTC */
#define SNVS_LPSRTCMR_SRTC_MASK   (0x7FFF << SNVS_LPSRTCMR_SRTC_SHIFT)
#define SNVS_LPSRTCMR_SRTC(n)     (((n) << SNVS_LPSRTCMR_SRTC_SHIFT) & SNVS_LPSRTCMR_SRTC_MASK)

/* SNVS_LP Secure Real Time Counter LSB Register (LPSRTCLR) */
#define SNVS_LPSRTCLR_SRTC_SHIFT  (0)  /* Bits 0-32: LP Secure Real Time Counter least-significant 32 bits This register can be programmed only when SRTC is not active and not locked, meaning the SRTC_ENV, SRTC_SL, and SRTC_HL bits are not set */
#define SNVS_LPSRTCLR_SRTC_MASK   (0xFFFFFFFF << SNVS_LPSRTCLR_SRTC_SHIFT)
#define SNVS_LPSRTCLR_SRTC(n)     (((n) << SNVS_LPSRTCLR_SRTC_SHIFT) & SNVS_LPSRTCLR_SRTC_MASK)

/* SNVS_LP Time Alarm Register (LPTAR) */
#define SNVS_LPTAR_LPTA_SHIFT  (0)  /* Bits 0-32: LP Time Alarm This register can be programmed only when the LP time alarm is disabled (LPTA_EN bit is not set) */
#define SNVS_LPTAR_LPTA_MASK   (0xFFFFFFFF << SNVS_LPTAR_LPTA_SHIFT)
#define SNVS_LPTAR_LPTA(n)     (((n) << SNVS_LPTAR_LPTA_SHIFT) & SNVS_LPTAR_LPTA_MASK)

/* SNVS_LP Secure Monotonic Counter MSB Register (LPSMCMR) */
#define SNVS_LPSMCMR_MON_COUNTER_SHIFT  (0)   /* Bits 0-16: Monotonic Counter most-significant 16 Bits Note that writing to this register does not change the value of this field to the value that was written */
#define SNVS_LPSMCMR_MON_COUNTER_MASK   (0xFFFF << SNVS_LPSMCMR_MON_COUNTER_SHIFT)
#define SNVS_LPSMCMR_MON_COUNTER(n)     (((n) << SNVS_LPSMCMR_MON_COUNTER_SHIFT) & SNVS_LPSMCMR_MON_COUNTER_MASK)
#define SNVS_LPSMCMR_MC_ERA_BITS_SHIFT  (16)  /* Bits 16-32: Monotonic Counter Era Bits These bits are inputs to the module and typically connect to fuses */
#define SNVS_LPSMCMR_MC_ERA_BITS_MASK   (0xFFFF << SNVS_LPSMCMR_MC_ERA_BITS_SHIFT)
#define SNVS_LPSMCMR_MC_ERA_BITS(n)     (((n) << SNVS_LPSMCMR_MC_ERA_BITS_SHIFT) & SNVS_LPSMCMR_MC_ERA_BITS_MASK)

/* SNVS_LP Secure Monotonic Counter LSB Register (LPSMCLR) */
#define SNVS_LPSMCLR_MON_COUNTER_SHIFT  (0)  /* Bits 0-32: Monotonic Counter bits Note that writing to this register does not change the value of this field to the value that was written */
#define SNVS_LPSMCLR_MON_COUNTER_MASK   (0xFFFFFFFF << SNVS_LPSMCLR_MON_COUNTER_SHIFT)
#define SNVS_LPSMCLR_MON_COUNTER(n)     (((n) << SNVS_LPSMCLR_MON_COUNTER_SHIFT) & SNVS_LPSMCLR_MON_COUNTER_MASK)

/* SNVS_LP Digital Low-Voltage Detector Register (LPLVDR) */
#define SNVS_LPLVDR_LVD_SHIFT  (0)  /* Bits 0-32: Low-Voltage Detector Value */
#define SNVS_LPLVDR_LVD_MASK   (0xFFFFFFFF << SNVS_LPLVDR_LVD_SHIFT)
#define SNVS_LPLVDR_LVD(n)     (((n) << SNVS_LPLVDR_LVD_SHIFT) & SNVS_LPLVDR_LVD_MASK)

/* SNVS_LP General Purpose Register 0 (legacy alias) (LPGPR0_LEGACY_ALIAS) */
#define SNVS_LPGPR0_LEGACY_ALIAS_GPR_SHIFT  (0)  /* Bits 0-32: General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed. */
#define SNVS_LPGPR0_LEGACY_ALIAS_GPR_MASK   (0xFFFFFFFF << SNVS_LPGPR0_LEGACY_ALIAS_GPR_SHIFT)
#define SNVS_LPGPR0_LEGACY_ALIAS_GPR(n)     (((n) << SNVS_LPGPR0_LEGACY_ALIAS_GPR_SHIFT) & SNVS_LPGPR0_LEGACY_ALIAS_GPR_MASK)

/* SNVS_LP Tamper Detectors Config 2 Register (LPTDC2R) */
#define SNVS_LPTDC2R_ET3_EN   (1 << 0)   /* Bit 0: External Tampering 3 Enable When set, external tampering 3 detection generates an LP security violation */
#define SNVS_LPTDC2R_ET4_EN   (1 << 1)   /* Bit 1: External Tampering 4 Enable When set, external tampering 4 detection generates an LP security violation */
#define SNVS_LPTDC2R_ET5_EN   (1 << 2)   /* Bit 2: External Tampering 5 Enable When set, external tampering 5 detection generates an LP security violation */
#define SNVS_LPTDC2R_ET6_EN   (1 << 3)   /* Bit 3: External Tampering 6 Enable When set, external tampering 6 detection generates an LP security violation */
#define SNVS_LPTDC2R_ET7_EN   (1 << 4)   /* Bit 4: External Tampering 7 Enable When set, external tampering 7 detection generates an LP security violation */
#define SNVS_LPTDC2R_ET8_EN   (1 << 5)   /* Bit 5: External Tampering 8 Enable When set, external tampering 8 detection generates an LP security violation */
#define SNVS_LPTDC2R_ET9_EN   (1 << 6)   /* Bit 6: External Tampering 9 Enable When set, external tampering 9 detection generates an LP security violation */
#define SNVS_LPTDC2R_ET10_EN  (1 << 7)   /* Bit 7: External Tampering 10 Enable When set, external tampering 10 detection generates an LP security violation */
#define SNVS_LPTDC2R_ET3P     (1 << 16)  /* Bit 16: External Tampering 3 Polarity This bit is used to determine the polarity of external tamper 3. */
#define SNVS_LPTDC2R_ET4P     (1 << 17)  /* Bit 17: External Tampering 4 Polarity This bit is used to determine the polarity of external tamper 4. */
#define SNVS_LPTDC2R_ET5P     (1 << 18)  /* Bit 18: External Tampering 5 Polarity This bit is used to determine the polarity of external tamper 5. */
#define SNVS_LPTDC2R_ET6P     (1 << 19)  /* Bit 19: External Tampering 6 Polarity This bit is used to determine the polarity of external tamper 6. */
#define SNVS_LPTDC2R_ET7P     (1 << 20)  /* Bit 20: External Tampering 7 Polarity This bit is used to determine the polarity of external tamper 7. */
#define SNVS_LPTDC2R_ET8P     (1 << 21)  /* Bit 21: External Tampering 8 Polarity This bit is used to determine the polarity of external tamper 8. */
#define SNVS_LPTDC2R_ET9P     (1 << 22)  /* Bit 22: External Tampering 9 Polarity This bit is used to determine the polarity of external tamper 9. */
#define SNVS_LPTDC2R_ET10P    (1 << 23)  /* Bit 23: External Tampering 10 Polarity This bit is used to determine the polarity of external tamper 10. */

/* SNVS_LP Tamper Detectors Status Register (LPTDSR) */
#define SNVS_LPTDSR_ET3D   (1 << 0)  /* Bit 0: External Tampering 3 Detected */
#define SNVS_LPTDSR_ET4D   (1 << 1)  /* Bit 1: External Tampering 4 Detected */
#define SNVS_LPTDSR_ET5D   (1 << 2)  /* Bit 2: External Tampering 5 Detected */
#define SNVS_LPTDSR_ET6D   (1 << 3)  /* Bit 3: External Tampering 6 Detected */
#define SNVS_LPTDSR_ET7D   (1 << 4)  /* Bit 4: External Tampering 7 Detected */
#define SNVS_LPTDSR_ET8D   (1 << 5)  /* Bit 5: External Tampering 8 Detected */
#define SNVS_LPTDSR_ET9D   (1 << 6)  /* Bit 6: External Tampering 9 Enable When set, external tampering 9 detection generates an LP security violation */
#define SNVS_LPTDSR_ET10D  (1 << 7)  /* Bit 7: External Tampering 10 Detected */

/* SNVS_LP Tamper Glitch Filter 1 Configuration Register (LPTGF1CR) */
#define SNVS_LPTGF1CR_ETGF3_SHIFT  (0)        /* Bits 0-7: External Tamper Glitch Filter 3 Configures the length of the digital glitch filter for the external tamper 3 pin between 128 and 32640 SRTC clock cycles */
#define SNVS_LPTGF1CR_ETGF3_MASK   (0x7F << SNVS_LPTGF1CR_ETGF3_SHIFT)
#define SNVS_LPTGF1CR_ETGF3(n)     (((n) << SNVS_LPTGF1CR_ETGF3_SHIFT) & SNVS_LPTGF1CR_ETGF3_MASK)
#define SNVS_LPTGF1CR_ETGF3_EN     (1 << 7)   /* Bit 7: External Tamper Glitch Filter 3 Enable When set, enables the external tamper glitch filter 3. */
#define SNVS_LPTGF1CR_ETGF4_SHIFT  (8)        /* Bits 8-15: External Tamper Glitch Filter 4 Configures the length of the digital glitch filter for the external tamper 4 pin between 128 and 32640 SRTC clock cycles */
#define SNVS_LPTGF1CR_ETGF4_MASK   (0x7F << SNVS_LPTGF1CR_ETGF4_SHIFT)
#define SNVS_LPTGF1CR_ETGF4(n)     (((n) << SNVS_LPTGF1CR_ETGF4_SHIFT) & SNVS_LPTGF1CR_ETGF4_MASK)
#define SNVS_LPTGF1CR_ETGF4_EN     (1 << 15)  /* Bit 15: External Tamper Glitch Filter 4 Enable When set, enables the external tamper glitch filter 4. */
#define SNVS_LPTGF1CR_ETGF5_SHIFT  (16)       /* Bits 16-23: External Tamper Glitch Filter 5 Configures the length of the digital glitch filter for the external tamper 5 pin between 128 and 32640 SRTC clock cycles */
#define SNVS_LPTGF1CR_ETGF5_MASK   (0x7F << SNVS_LPTGF1CR_ETGF5_SHIFT)
#define SNVS_LPTGF1CR_ETGF5(n)     (((n) << SNVS_LPTGF1CR_ETGF5_SHIFT) & SNVS_LPTGF1CR_ETGF5_MASK)
#define SNVS_LPTGF1CR_ETGF5_EN     (1 << 23)  /* Bit 23: External Tamper Glitch Filter 5 Enable When set, enables the external tamper glitch filter 5. */
#define SNVS_LPTGF1CR_ETGF6_SHIFT  (24)       /* Bits 24-31: External Tamper Glitch Filter 6 Configures the length of the digital glitch filter for the external tamper 6 pin between 128 and 32640 SRTC clock cycles */
#define SNVS_LPTGF1CR_ETGF6_MASK   (0x7F << SNVS_LPTGF1CR_ETGF6_SHIFT)
#define SNVS_LPTGF1CR_ETGF6(n)     (((n) << SNVS_LPTGF1CR_ETGF6_SHIFT) & SNVS_LPTGF1CR_ETGF6_MASK)
#define SNVS_LPTGF1CR_ETGF6_EN     (1 << 31)  /* Bit 31: External Tamper Glitch Filter 6 Enable When set, enables the external tamper glitch filter 6. */

/* SNVS_LP Tamper Glitch Filter 2 Configuration Register (LPTGF2CR) */
#define SNVS_LPTGF2CR_ETGF7_SHIFT   (0)        /* Bits 0-7: External Tamper Glitch Filter 7 Configures the length of the digital glitch filter for the external tamper 7 pin between 128 and 32640 SRTC clock cycles */
#define SNVS_LPTGF2CR_ETGF7_MASK    (0x7F << SNVS_LPTGF2CR_ETGF7_SHIFT)
#define SNVS_LPTGF2CR_ETGF7(n)      (((n) << SNVS_LPTGF2CR_ETGF7_SHIFT) & SNVS_LPTGF2CR_ETGF7_MASK)
#define SNVS_LPTGF2CR_ETGF7_EN      (1 << 7)   /* Bit 7: External Tamper Glitch Filter 7 Enable When set, enables the external tamper glitch filter 7. */
#define SNVS_LPTGF2CR_ETGF8_SHIFT   (8)        /* Bits 8-15: External Tamper Glitch Filter 8 Configures the length of the digital glitch filter for the external tamper 8 pin between 128 and 32640 SRTC clock cycles */
#define SNVS_LPTGF2CR_ETGF8_MASK    (0x7F << SNVS_LPTGF2CR_ETGF8_SHIFT)
#define SNVS_LPTGF2CR_ETGF8(n)      (((n) << SNVS_LPTGF2CR_ETGF8_SHIFT) & SNVS_LPTGF2CR_ETGF8_MASK)
#define SNVS_LPTGF2CR_ETGF8_EN      (1 << 15)  /* Bit 15: External Tamper Glitch Filter 8 Enable When set, enables the external tamper glitch filter 8. */
#define SNVS_LPTGF2CR_ETGF9_SHIFT   (16)       /* Bits 16-23: External Tamper Glitch Filter 9 Configures the length of the digital glitch filter for the external tamper 9 pin between 128 and 32640 SRTC clock cycles */
#define SNVS_LPTGF2CR_ETGF9_MASK    (0x7F << SNVS_LPTGF2CR_ETGF9_SHIFT)
#define SNVS_LPTGF2CR_ETGF9(n)      (((n) << SNVS_LPTGF2CR_ETGF9_SHIFT) & SNVS_LPTGF2CR_ETGF9_MASK)
#define SNVS_LPTGF2CR_ETGF9_EN      (1 << 23)  /* Bit 23: External Tamper Glitch Filter 9 Enable When set, enables the external tamper glitch filter 9. */
#define SNVS_LPTGF2CR_ETGF10_SHIFT  (24)       /* Bits 24-31: External Tamper Glitch Filter 10 Configures the length of the digital glitch filter for the external tamper 10 pin between 128 and 32640 SRTC clock cycles */
#define SNVS_LPTGF2CR_ETGF10_MASK   (0x7F << SNVS_LPTGF2CR_ETGF10_SHIFT)
#define SNVS_LPTGF2CR_ETGF10(n)     (((n) << SNVS_LPTGF2CR_ETGF10_SHIFT) & SNVS_LPTGF2CR_ETGF10_MASK)
#define SNVS_LPTGF2CR_ETGF10_EN     (1 << 31)  /* Bit 31: External Tamper Glitch Filter 10 Enable When set, enables the external tamper glitch filter 10. */

