apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_snvs.h
/* SNVS_LP Active Tamper 1 Configuration Register (LPAT1CR) */
#define SNVS_LPAT1CR_SEED_SHIFT        (0)   /* Bits 0-16: Active Tamper 1 Initial Seed Default Seed is 1111h. */
#define SNVS_LPAT1CR_SEED_MASK         (0xFFFF << SNVS_LPAT1CR_SEED_SHIFT)
#define SNVS_LPAT1CR_SEED(n)           (((n) << SNVS_LPAT1CR_SEED_SHIFT) & SNVS_LPAT1CR_Seed_MASK)
#define SNVS_LPAT1CR_POLYNOMIAL_SHIFT  (16)  /* Bits 16-32: Active Tamper 1 Polynomial Default Polynomial is 8400h. */
#define SNVS_LPAT1CR_POLYNOMIAL_MASK   (0xFFFF << SNVS_LPAT1CR_POLYNOMIAL_SHIFT)
#define SNVS_LPAT1CR_POLYNOMIAL(n)     (((n) << SNVS_LPAT1CR_POLYNOMIAL_SHIFT) & SNVS_LPAT1CR_Polynomial_MASK)

/* SNVS_LP Active Tamper 2 Configuration Register (LPAT2CR) */
#define SNVS_LPAT2CR_SEED_SHIFT        (0)   /* Bits 0-16: Active Tamper 2 Initial Seed Default Seed is 2222h. */
#define SNVS_LPAT2CR_SEED_MASK         (0xFFFF << SNVS_LPAT2CR_SEED_SHIFT)
#define SNVS_LPAT2CR_SEED(n)           (((n) << SNVS_LPAT2CR_SEED_SHIFT) & SNVS_LPAT2CR_Seed_MASK)
#define SNVS_LPAT2CR_POLYNOMIAL_SHIFT  (16)  /* Bits 16-32: Active Tamper 2 Polynomial Default Polynomial is 9C00h. */
#define SNVS_LPAT2CR_POLYNOMIAL_MASK   (0xFFFF << SNVS_LPAT2CR_POLYNOMIAL_SHIFT)
#define SNVS_LPAT2CR_POLYNOMIAL(n)     (((n) << SNVS_LPAT2CR_POLYNOMIAL_SHIFT) & SNVS_LPAT2CR_Polynomial_MASK)

/* SNVS_LP Active Tamper 3 Configuration Register (LPAT3CR) */
#define SNVS_LPAT3CR_SEED_SHIFT        (0)   /* Bits 0-16: Active Tamper 3 Initial Seed Default Seed is 3333h. */
#define SNVS_LPAT3CR_SEED_MASK         (0xFFFF << SNVS_LPAT3CR_SEED_SHIFT)
#define SNVS_LPAT3CR_SEED(n)           (((n) << SNVS_LPAT3CR_SEED_SHIFT) & SNVS_LPAT3CR_Seed_MASK)
#define SNVS_LPAT3CR_POLYNOMIAL_SHIFT  (16)  /* Bits 16-32: Active Tamper 3 Polynomial Default Polynomial is CA00h. */
#define SNVS_LPAT3CR_POLYNOMIAL_MASK   (0xFFFF << SNVS_LPAT3CR_POLYNOMIAL_SHIFT)
#define SNVS_LPAT3CR_POLYNOMIAL(n)     (((n) << SNVS_LPAT3CR_POLYNOMIAL_SHIFT) & SNVS_LPAT3CR_Polynomial_MASK)

/* SNVS_LP Active Tamper 4 Configuration Register (LPAT4CR) */
#define SNVS_LPAT4CR_SEED_SHIFT        (0)   /* Bits 0-16: Active Tamper 4 Initial Seed Default Seed is 4444h. */
#define SNVS_LPAT4CR_SEED_MASK         (0xFFFF << SNVS_LPAT4CR_SEED_SHIFT)
#define SNVS_LPAT4CR_SEED(n)           (((n) << SNVS_LPAT4CR_SEED_SHIFT) & SNVS_LPAT4CR_Seed_MASK)
#define SNVS_LPAT4CR_POLYNOMIAL_SHIFT  (16)  /* Bits 16-32: Active Tamper 4 Polynomial Default Polynomial is 8580h. */
#define SNVS_LPAT4CR_POLYNOMIAL_MASK   (0xFFFF << SNVS_LPAT4CR_POLYNOMIAL_SHIFT)
#define SNVS_LPAT4CR_POLYNOMIAL(n)     (((n) << SNVS_LPAT4CR_POLYNOMIAL_SHIFT) & SNVS_LPAT4CR_Polynomial_MASK)

/* SNVS_LP Active Tamper 5 Configuration Register (LPAT5CR) */
#define SNVS_LPAT5CR_SEED_SHIFT        (0)   /* Bits 0-16: Active Tamper 5 Initial Seed Default Seed is 5555h. */
#define SNVS_LPAT5CR_SEED_MASK         (0xFFFF << SNVS_LPAT5CR_SEED_SHIFT)
#define SNVS_LPAT5CR_SEED(n)           (((n) << SNVS_LPAT5CR_SEED_SHIFT) & SNVS_LPAT5CR_Seed_MASK)
#define SNVS_LPAT5CR_POLYNOMIAL_SHIFT  (16)  /* Bits 16-32: Active Tamper 5 Polynomial Default Polynomial is A840h. */
#define SNVS_LPAT5CR_POLYNOMIAL_MASK   (0xFFFF << SNVS_LPAT5CR_POLYNOMIAL_SHIFT)
#define SNVS_LPAT5CR_POLYNOMIAL(n)     (((n) << SNVS_LPAT5CR_POLYNOMIAL_SHIFT) & SNVS_LPAT5CR_Polynomial_MASK)

/* SNVS_LP Active Tamper Control Register (LPATCTLR) */
#define SNVS_LPATCTLR_AT1_EN      (1 << 0)   /* Bit 0: Active Tamper 1 Enable When set, enables the Active Tamper 1 LFSR. */
#define SNVS_LPATCTLR_AT2_EN      (1 << 1)   /* Bit 1: Active Tamper 2 Enable When set, enables the Active Tamper 2 LFSR. */
#define SNVS_LPATCTLR_AT3_EN      (1 << 2)   /* Bit 2: Active Tamper 3 Enable When set, enables the Active Tamper 3 LFSR. */
#define SNVS_LPATCTLR_AT4_EN      (1 << 3)   /* Bit 3: Active Tamper 4 Enable When set, enables the Active Tamper 4 LFSR. */
#define SNVS_LPATCTLR_AT5_EN      (1 << 4)   /* Bit 4: Active Tamper 5 Enable When set, enables the Active Tamper 5 LFSR. */
#define SNVS_LPATCTLR_AT1_PAD_EN  (1 << 16)  /* Bit 16: Active Tamper 1 Pad Out Enable When set, enables the Active Tamper 1 external pad. */
#define SNVS_LPATCTLR_AT2_PAD_EN  (1 << 17)  /* Bit 17: Active Tamper 2 Pad Out Enable When set, enables the Active Tamper 2 external pad. */
#define SNVS_LPATCTLR_AT3_PAD_EN  (1 << 18)  /* Bit 18: Active Tamper 3 Pad Out Enable When set, enables the Active Tamper 3 external pad. */
#define SNVS_LPATCTLR_AT4_PAD_EN  (1 << 19)  /* Bit 19: Active Tamper 4 Pad Out Enable When set, enables the Active Tamper 4 external pad. */
#define SNVS_LPATCTLR_AT5_PAD_EN  (1 << 20)  /* Bit 20: Active Tamper 5 Pad Out Enable When set, enables the Active Tamper 5 external pad. */

/* SNVS_LP Active Tamper Clock Control Register (LPATCLKR) */
#define SNVS_LPATCLKR_AT1_CLK_CTL_SHIFT  (0)   /* Bits 0-2: Active Tamper 1 Clock Control 00: 16hz 01: 8hz 10: 4hz 11: 2hz */
#define SNVS_LPATCLKR_AT1_CLK_CTL_MASK   (0x3 << SNVS_LPATCLKR_AT1_CLK_CTL_SHIFT)
#define SNVS_LPATCLKR_AT1_CLK_CTL(n)     (((n) << SNVS_LPATCLKR_AT1_CLK_CTL_SHIFT) & SNVS_LPATCLKR_AT1_CLK_CTL_MASK)
#define SNVS_LPATCLKR_AT2_CLK_CTL_SHIFT  (4)   /* Bits 4-6: Active Tamper 2 Clock Control 00: 16hz 01: 8hz 10: 4hz 11: 2hz */
#define SNVS_LPATCLKR_AT2_CLK_CTL_MASK   (0x3 << SNVS_LPATCLKR_AT2_CLK_CTL_SHIFT)
#define SNVS_LPATCLKR_AT2_CLK_CTL(n)     (((n) << SNVS_LPATCLKR_AT2_CLK_CTL_SHIFT) & SNVS_LPATCLKR_AT2_CLK_CTL_MASK)
#define SNVS_LPATCLKR_AT3_CLK_CTL_SHIFT  (8)   /* Bits 8-10: Active Tamper 3 Clock Control 00: 16hz 01: 8hz 10: 4hz 11: 2hz */
#define SNVS_LPATCLKR_AT3_CLK_CTL_MASK   (0x3 << SNVS_LPATCLKR_AT3_CLK_CTL_SHIFT)
#define SNVS_LPATCLKR_AT3_CLK_CTL(n)     (((n) << SNVS_LPATCLKR_AT3_CLK_CTL_SHIFT) & SNVS_LPATCLKR_AT3_CLK_CTL_MASK)
#define SNVS_LPATCLKR_AT4_CLK_CTL_SHIFT  (12)  /* Bits 12-14: Active Tamper 4 Clock Control 00: 16hz 01: 8hz 10: 4hz 11: 2hz */
#define SNVS_LPATCLKR_AT4_CLK_CTL_MASK   (0x3 << SNVS_LPATCLKR_AT4_CLK_CTL_SHIFT)
#define SNVS_LPATCLKR_AT4_CLK_CTL(n)     (((n) << SNVS_LPATCLKR_AT4_CLK_CTL_SHIFT) & SNVS_LPATCLKR_AT4_CLK_CTL_MASK)
#define SNVS_LPATCLKR_AT5_CLK_CTL_SHIFT  (16)  /* Bits 16-18: Active Tamper 5 Clock Control 00: 16hz 01: 8hz 10: 4hz 11: 2hz */
#define SNVS_LPATCLKR_AT5_CLK_CTL_MASK   (0x3 << SNVS_LPATCLKR_AT5_CLK_CTL_SHIFT)
#define SNVS_LPATCLKR_AT5_CLK_CTL(n)     (((n) << SNVS_LPATCLKR_AT5_CLK_CTL_SHIFT) & SNVS_LPATCLKR_AT5_CLK_CTL_MASK)

/* SNVS_LP Active Tamper Routing Control 1 Register (LPATRC1R) */
#define SNVS_LPATRC1R_ET1RCTL_SHIFT  (0)   /* Bits 0-3: External Tamper 1 Routing Control Any undefined selection will be routed to passive */
#define SNVS_LPATRC1R_ET1RCTL_MASK   (0x7 << SNVS_LPATRC1R_ET1RCTL_SHIFT)
#define SNVS_LPATRC1R_ET1RCTL(n)     (((n) << SNVS_LPATRC1R_ET1RCTL_SHIFT) & SNVS_LPATRC1R_ET1RCTL_MASK)
#define SNVS_LPATRC1R_ET2RCTL_SHIFT  (4)   /* Bits 4-7: External Tamper 2 Routing Control Any undefined selection will be routed to passive */
#define SNVS_LPATRC1R_ET2RCTL_MASK   (0x7 << SNVS_LPATRC1R_ET2RCTL_SHIFT)
#define SNVS_LPATRC1R_ET2RCTL(n)     (((n) << SNVS_LPATRC1R_ET2RCTL_SHIFT) & SNVS_LPATRC1R_ET2RCTL_MASK)
#define SNVS_LPATRC1R_ET3RCTL_SHIFT  (8)   /* Bits 8-11: External Tamper 3 Routing Control Any undefined selection will be routed to passive */
#define SNVS_LPATRC1R_ET3RCTL_MASK   (0x7 << SNVS_LPATRC1R_ET3RCTL_SHIFT)
#define SNVS_LPATRC1R_ET3RCTL(n)     (((n) << SNVS_LPATRC1R_ET3RCTL_SHIFT) & SNVS_LPATRC1R_ET3RCTL_MASK)
#define SNVS_LPATRC1R_ET4RCTL_SHIFT  (12)  /* Bits 12-15: External Tamper 4 Routing Control Any undefined selection will be routed to passive */
#define SNVS_LPATRC1R_ET4RCTL_MASK   (0x7 << SNVS_LPATRC1R_ET4RCTL_SHIFT)
#define SNVS_LPATRC1R_ET4RCTL(n)     (((n) << SNVS_LPATRC1R_ET4RCTL_SHIFT) & SNVS_LPATRC1R_ET4RCTL_MASK)
#define SNVS_LPATRC1R_ET5RCTL_SHIFT  (16)  /* Bits 16-19: External Tamper 5 Routing Control Any undefined selection will be routed to passive */
#define SNVS_LPATRC1R_ET5RCTL_MASK   (0x7 << SNVS_LPATRC1R_ET5RCTL_SHIFT)
#define SNVS_LPATRC1R_ET5RCTL(n)     (((n) << SNVS_LPATRC1R_ET5RCTL_SHIFT) & SNVS_LPATRC1R_ET5RCTL_MASK)
#define SNVS_LPATRC1R_ET6RCTL_SHIFT  (20)  /* Bits 20-23: External Tamper 6 Routing Control Any undefined selection will be routed to passive */
#define SNVS_LPATRC1R_ET6RCTL_MASK   (0x7 << SNVS_LPATRC1R_ET6RCTL_SHIFT)
#define SNVS_LPATRC1R_ET6RCTL(n)     (((n) << SNVS_LPATRC1R_ET6RCTL_SHIFT) & SNVS_LPATRC1R_ET6RCTL_MASK)
#define SNVS_LPATRC1R_ET7RCTL_SHIFT  (24)  /* Bits 24-27: External Tamper 7 Routing Control Any undefined selection will be routed to passive */
#define SNVS_LPATRC1R_ET7RCTL_MASK   (0x7 << SNVS_LPATRC1R_ET7RCTL_SHIFT)
#define SNVS_LPATRC1R_ET7RCTL(n)     (((n) << SNVS_LPATRC1R_ET7RCTL_SHIFT) & SNVS_LPATRC1R_ET7RCTL_MASK)
#define SNVS_LPATRC1R_ET8RCTL_SHIFT  (28)  /* Bits 28-31: External Tamper 8 Routing Control Any undefined selection will be routed to passive */
#define SNVS_LPATRC1R_ET8RCTL_MASK   (0x7 << SNVS_LPATRC1R_ET8RCTL_SHIFT)
#define SNVS_LPATRC1R_ET8RCTL(n)     (((n) << SNVS_LPATRC1R_ET8RCTL_SHIFT) & SNVS_LPATRC1R_ET8RCTL_MASK)

