apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_snvs.h
/* SNVS_LP Active Tamper Routing Control 2 Register (LPATRC2R) */
#define SNVS_LPATRC2R_ET9RCTL_SHIFT   (0)  /* Bits 0-3: External Tamper 9 Routing Control Any undefined selection will be routed to passive */
#define SNVS_LPATRC2R_ET9RCTL_MASK    (0x7 << SNVS_LPATRC2R_ET9RCTL_SHIFT)
#define SNVS_LPATRC2R_ET9RCTL(n)      (((n) << SNVS_LPATRC2R_ET9RCTL_SHIFT) & SNVS_LPATRC2R_ET9RCTL_MASK)
#define SNVS_LPATRC2R_ET10RCTL_SHIFT  (4)  /* Bits 4-7: External Tamper 10 Routing Control Any undefined selection will be routed to passive */
#define SNVS_LPATRC2R_ET10RCTL_MASK   (0x7 << SNVS_LPATRC2R_ET10RCTL_SHIFT)
#define SNVS_LPATRC2R_ET10RCTL(n)     (((n) << SNVS_LPATRC2R_ET10RCTL_SHIFT) & SNVS_LPATRC2R_ET10RCTL_MASK)

/* SNVS_HP Version ID Register 1 (HPVIDR1) */
#define SNVS_HPVIDR1_MINOR_REV_SHIFT  (0)   /* Bits 0-8: SNVS block minor version number */
#define SNVS_HPVIDR1_MINOR_REV_MASK   (0xFF << SNVS_HPVIDR1_MINOR_REV_SHIFT)
#define SNVS_HPVIDR1_MINOR_REV(n)     (((n) << SNVS_HPVIDR1_MINOR_REV_SHIFT) & SNVS_HPVIDR1_MINOR_REV_MASK)
#define SNVS_HPVIDR1_MAJOR_REV_SHIFT  (8)   /* Bits 8-16: SNVS block major version number */
#define SNVS_HPVIDR1_MAJOR_REV_MASK   (0xFF << SNVS_HPVIDR1_MAJOR_REV_SHIFT)
#define SNVS_HPVIDR1_MAJOR_REV(n)     (((n) << SNVS_HPVIDR1_MAJOR_REV_SHIFT) & SNVS_HPVIDR1_MAJOR_REV_MASK)
#define SNVS_HPVIDR1_IP_ID_SHIFT      (16)  /* Bits 16-32: SNVS block ID */
#define SNVS_HPVIDR1_IP_ID_MASK       (0xFFFF << SNVS_HPVIDR1_IP_ID_SHIFT)
#define SNVS_HPVIDR1_IP_ID(n)         (((n) << SNVS_HPVIDR1_IP_ID_SHIFT) & SNVS_HPVIDR1_IP_ID_MASK)

/* SNVS_HP Version ID Register 2 (HPVIDR2) */
#define SNVS_HPVIDR2_ECO_REV_SHIFT  (8)   /* Bits 8-16: SNVS ECO Revision The engineering change order revision number for this release of SNVS. */
#define SNVS_HPVIDR2_ECO_REV_MASK   (0xFF << SNVS_HPVIDR2_ECO_REV_SHIFT)
#define SNVS_HPVIDR2_ECO_REV(n)     (((n) << SNVS_HPVIDR2_ECO_REV_SHIFT) & SNVS_HPVIDR2_ECO_REV_MASK)
#define SNVS_HPVIDR2_IP_ERA_SHIFT   (24)  /* Bits 24-32: IP Era 00h - Era 1 or 2 03h - Era 3 04h - Era 4 05h - Era 5 06h - Era 6 */
#define SNVS_HPVIDR2_IP_ERA_MASK    (0xFF << SNVS_HPVIDR2_IP_ERA_SHIFT)
#define SNVS_HPVIDR2_IP_ERA(n)      (((n) << SNVS_HPVIDR2_IP_ERA_SHIFT) & SNVS_HPVIDR2_IP_ERA_MASK)

/* SNVS_LP Zeroizable Master Key Register (LPZMKR0) */
#define SNVS_LPZMKR0_ZMK_SHIFT  (0)  /* Bits 0-32: Zeroizable Master Key Each of these registers contains 32 bits of the 256-bit ZMK value */
#define SNVS_LPZMKR0_ZMK_MASK   (0xFFFFFFFF << SNVS_LPZMKR0_ZMK_SHIFT)
#define SNVS_LPZMKR0_ZMK(n)     (((n) << SNVS_LPZMKR0_ZMK_SHIFT) & SNVS_LPZMKR0_ZMK_MASK)

/* SNVS_LP Zeroizable Master Key Register (LPZMKR1) */
#define SNVS_LPZMKR1_ZMK_SHIFT  (0)  /* Bits 0-32: Zeroizable Master Key Each of these registers contains 32 bits of the 256-bit ZMK value */
#define SNVS_LPZMKR1_ZMK_MASK   (0xFFFFFFFF << SNVS_LPZMKR1_ZMK_SHIFT)
#define SNVS_LPZMKR1_ZMK(n)     (((n) << SNVS_LPZMKR1_ZMK_SHIFT) & SNVS_LPZMKR1_ZMK_MASK)

/* SNVS_LP Zeroizable Master Key Register (LPZMKR2) */
#define SNVS_LPZMKR2_ZMK_SHIFT  (0)  /* Bits 0-32: Zeroizable Master Key Each of these registers contains 32 bits of the 256-bit ZMK value */
#define SNVS_LPZMKR2_ZMK_MASK   (0xFFFFFFFF << SNVS_LPZMKR2_ZMK_SHIFT)
#define SNVS_LPZMKR2_ZMK(n)     (((n) << SNVS_LPZMKR2_ZMK_SHIFT) & SNVS_LPZMKR2_ZMK_MASK)

/* SNVS_LP Zeroizable Master Key Register (LPZMKR3) */
#define SNVS_LPZMKR3_ZMK_SHIFT  (0)  /* Bits 0-32: Zeroizable Master Key Each of these registers contains 32 bits of the 256-bit ZMK value */
#define SNVS_LPZMKR3_ZMK_MASK   (0xFFFFFFFF << SNVS_LPZMKR3_ZMK_SHIFT)
#define SNVS_LPZMKR3_ZMK(n)     (((n) << SNVS_LPZMKR3_ZMK_SHIFT) & SNVS_LPZMKR3_ZMK_MASK)

/* SNVS_LP Zeroizable Master Key Register (LPZMKR4) */
#define SNVS_LPZMKR4_ZMK_SHIFT  (0)  /* Bits 0-32: Zeroizable Master Key Each of these registers contains 32 bits of the 256-bit ZMK value */
#define SNVS_LPZMKR4_ZMK_MASK   (0xFFFFFFFF << SNVS_LPZMKR4_ZMK_SHIFT)
#define SNVS_LPZMKR4_ZMK(n)     (((n) << SNVS_LPZMKR4_ZMK_SHIFT) & SNVS_LPZMKR4_ZMK_MASK)

/* SNVS_LP Zeroizable Master Key Register (LPZMKR5) */
#define SNVS_LPZMKR5_ZMK_SHIFT  (0)  /* Bits 0-32: Zeroizable Master Key Each of these registers contains 32 bits of the 256-bit ZMK value */
#define SNVS_LPZMKR5_ZMK_MASK   (0xFFFFFFFF << SNVS_LPZMKR5_ZMK_SHIFT)
#define SNVS_LPZMKR5_ZMK(n)     (((n) << SNVS_LPZMKR5_ZMK_SHIFT) & SNVS_LPZMKR5_ZMK_MASK)

/* SNVS_LP Zeroizable Master Key Register (LPZMKR6) */
#define SNVS_LPZMKR6_ZMK_SHIFT  (0)  /* Bits 0-32: Zeroizable Master Key Each of these registers contains 32 bits of the 256-bit ZMK value */
#define SNVS_LPZMKR6_ZMK_MASK   (0xFFFFFFFF << SNVS_LPZMKR6_ZMK_SHIFT)
#define SNVS_LPZMKR6_ZMK(n)     (((n) << SNVS_LPZMKR6_ZMK_SHIFT) & SNVS_LPZMKR6_ZMK_MASK)

/* SNVS_LP Zeroizable Master Key Register (LPZMKR7) */
#define SNVS_LPZMKR7_ZMK_SHIFT  (0)  /* Bits 0-32: Zeroizable Master Key Each of these registers contains 32 bits of the 256-bit ZMK value */
#define SNVS_LPZMKR7_ZMK_MASK   (0xFFFFFFFF << SNVS_LPZMKR7_ZMK_SHIFT)
#define SNVS_LPZMKR7_ZMK(n)     (((n) << SNVS_LPZMKR7_ZMK_SHIFT) & SNVS_LPZMKR7_ZMK_MASK)

/* SNVS_LP General Purpose Registers 0 .. 3 (LPGPR_ALIAS0) */
#define SNVS_LPGPR_ALIAS0_GPR_SHIFT  (0)  /* Bits 0-32: General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed. */
#define SNVS_LPGPR_ALIAS0_GPR_MASK   (0xFFFFFFFF << SNVS_LPGPR_ALIAS0_GPR_SHIFT)
#define SNVS_LPGPR_ALIAS0_GPR(n)     (((n) << SNVS_LPGPR_ALIAS0_GPR_SHIFT) & SNVS_LPGPR_ALIAS0_GPR_MASK)

/* SNVS_LP General Purpose Registers 0 .. 3 (LPGPR_ALIAS1) */
#define SNVS_LPGPR_ALIAS1_GPR_SHIFT  (0)  /* Bits 0-32: General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed. */
#define SNVS_LPGPR_ALIAS1_GPR_MASK   (0xFFFFFFFF << SNVS_LPGPR_ALIAS1_GPR_SHIFT)
#define SNVS_LPGPR_ALIAS1_GPR(n)     (((n) << SNVS_LPGPR_ALIAS1_GPR_SHIFT) & SNVS_LPGPR_ALIAS1_GPR_MASK)

/* SNVS_LP General Purpose Registers 0 .. 3 (LPGPR_ALIAS2) */
#define SNVS_LPGPR_ALIAS2_GPR_SHIFT  (0)  /* Bits 0-32: General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed. */
#define SNVS_LPGPR_ALIAS2_GPR_MASK   (0xFFFFFFFF << SNVS_LPGPR_ALIAS2_GPR_SHIFT)
#define SNVS_LPGPR_ALIAS2_GPR(n)     (((n) << SNVS_LPGPR_ALIAS2_GPR_SHIFT) & SNVS_LPGPR_ALIAS2_GPR_MASK)

/* SNVS_LP General Purpose Registers 0 .. 3 (LPGPR_ALIAS3) */
#define SNVS_LPGPR_ALIAS3_GPR_SHIFT  (0)  /* Bits 0-32: General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed. */
#define SNVS_LPGPR_ALIAS3_GPR_MASK   (0xFFFFFFFF << SNVS_LPGPR_ALIAS3_GPR_SHIFT)
#define SNVS_LPGPR_ALIAS3_GPR(n)     (((n) << SNVS_LPGPR_ALIAS3_GPR_SHIFT) & SNVS_LPGPR_ALIAS3_GPR_MASK)

