apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_snvs.h
/* SNVS_LP General Purpose Registers 0 .. 3 (LPGPR0) */
#define SNVS_LPGPR0_GPR_SHIFT  (0)  /* Bits 0-32: General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed. */
#define SNVS_LPGPR0_GPR_MASK   (0xFFFFFFFF << SNVS_LPGPR0_GPR_SHIFT)
#define SNVS_LPGPR0_GPR(n)     (((n) << SNVS_LPGPR0_GPR_SHIFT) & SNVS_LPGPR0_GPR_MASK)

/* SNVS_LP General Purpose Registers 0 .. 3 (LPGPR1) */
#define SNVS_LPGPR1_GPR_SHIFT  (0)  /* Bits 0-32: General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed. */
#define SNVS_LPGPR1_GPR_MASK   (0xFFFFFFFF << SNVS_LPGPR1_GPR_SHIFT)
#define SNVS_LPGPR1_GPR(n)     (((n) << SNVS_LPGPR1_GPR_SHIFT) & SNVS_LPGPR1_GPR_MASK)

/* SNVS_LP General Purpose Registers 0 .. 3 (LPGPR2) */
#define SNVS_LPGPR2_GPR_SHIFT  (0)  /* Bits 0-32: General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed. */
#define SNVS_LPGPR2_GPR_MASK   (0xFFFFFFFF << SNVS_LPGPR2_GPR_SHIFT)
#define SNVS_LPGPR2_GPR(n)     (((n) << SNVS_LPGPR2_GPR_SHIFT) & SNVS_LPGPR2_GPR_MASK)

/* SNVS_LP General Purpose Registers 0 .. 3 (LPGPR3) */
#define SNVS_LPGPR3_GPR_SHIFT  (0)  /* Bits 0-32: General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed. */
#define SNVS_LPGPR3_GPR_MASK   (0xFFFFFFFF << SNVS_LPGPR3_GPR_SHIFT)
#define SNVS_LPGPR3_GPR(n)     (((n) << SNVS_LPGPR3_GPR_SHIFT) & SNVS_LPGPR3_GPR_MASK)

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_SNVS_H */
